{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\rmodel_mine.py\u00da\b<lambda>I\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "input_dtype": "float32", "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 160, 320, 3], "output_shape": null}}, {"class_name": "Cropping2D", "config": {"input_dtype": "float32", "name": "cropping2d_1", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 8, "trainable": true, "nb_row": 8, "dim_ordering": "tf", "subsample": [4, 4], "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 16, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 5, "trainable": true, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 32, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 5, "trainable": true, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 64, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "output_dim": 512, "W_regularizer": null, "W_constraint": null, "input_dim": 6400, "name": "dense_1", "activity_regularizer": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "output_dim": 1, "W_regularizer": null, "W_constraint": null, "input_dim": 512, "name": "dense_2", "activity_regularizer": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear"}}]}